Idealized_Reef_CFD/Scenario_50/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          25;
        startFace       504868;
    }
    outlet
    {
        type            patch;
        nFaces          43;
        startFace       504893;
    }
    atmosphere
    {
        type            patch;
        nFaces          1410;
        startFace       504936;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          505146;
        startFace       506346;
    }
    bedSurface
    {
        type            wall;
        inGroups        1(wall);
        nFaces          8493;
        startFace       1011492;
    }
)

// ************************************************************************* //
